compressiblePhaseChangeInterFoam_v2206/tutorials/thermosyphonTutorial/fluid/constant/phaseChangeProp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalConductivity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

betaEvaporation           20;

betaCondensation          20;

Tsat                      293.15;   //sul paper diceva 20 gradi working temperature

vaporizationEnthalpy      1370e3;

// ************************************************************************* //
